To install Pandas

In [2]:
!pip3 install pandas

Requirement already satisfied: pandas in c:\users\thula\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\thula\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\thula\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\thula\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\thula\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\thula\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

Import pandas

In [3]:
import pandas as pd

Pandas - to deal with Series & Dataframe

In [4]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [5]:
pandas=dir(pd)
print(pandas)

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_built_with_meson', '_config', '_is_numpy_dev', '_libs', '_pandas_datetime_CAPI', '_pandas_parser_CAPI', '_testing', '_typing', '_version_meson', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [6]:
print(len(pandas))

141

Series

In [7]:
a = pd.Series(["raj","ram","rahul"])
print(a)
print(type(a))

0      raj
1      ram
2    rahul
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
a = pd.Series([1,2,3])
print(a)
print(type(a))

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
a = pd.Series([1,2,3],index=["a","b","c"])
print(a)
print(type(a))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
a = pd.Series([1,2,3],index= ["A","B","C"])
print(a)

A    1
B    2
C    3
dtype: int64

In [11]:
dataset = pd.read_csv("credit_risk_dataset.csv")

In [12]:
dataset.head()

   Age  Annual_Income  Credit_Score  Default_Risk
0   59         116354           715             0
1   49         104651           546             0
2   35          83335           738             0
3   28          30965           502             1
4   41          44538           483             0

In [13]:
dataset.tail()

    Age  Annual_Income  Credit_Score  Default_Risk
95   54          75680           817             0
96   53          66717           398             0
97   43         107092           336             0
98   44          70859           579             0
99   57          46309           648             0

In [14]:
print(type(dataset))

<class 'pandas.core.frame.DataFrame'>

In [15]:
x=dataset[[	"Age",	"Annual_Income",	"Credit_Score"]]

In [16]:
x.head()

   Age  Annual_Income  Credit_Score
0   59         116354           715
1   49         104651           546
2   35          83335           738
3   28          30965           502
4   41          44538           483

In [17]:
y=dataset["Age"]

In [18]:
y.head()

0    59
1    49
2    35
3    28
4    41
Name: Age, dtype: int64

In [19]:
type(y)

pandas.core.series.Series

In [20]:
type(x)

pandas.core.frame.DataFrame

In [21]:
x.ndim

2

In [22]:
y.ndim

1

Creating a Dataframe

In [23]:
data = {"Name":["Raj","Segar","Nahul","Kannan","Ram","Navin","Akalya"] ,
        "Salary":[100000,80000,90000,200000,150000,120000,30000],
        "Age":[22,34,32,40,28,45,21]}

In [24]:
data

{'Name': ['Raj', 'Segar', 'Nahul', 'Kannan', 'Ram', 'Navin', 'Akalya'],
 'Salary': [100000, 80000, 90000, 200000, 150000, 120000, 30000],
 'Age': [22, 34, 32, 40, 28, 45, 21]}

In [25]:
type(data)

dict

In [26]:
Info=pd.DataFrame(data)

In [27]:
Info

     Name  Salary  Age
0     Raj  100000   22
1   Segar   80000   34
2   Nahul   90000   32
3  Kannan  200000   40
4     Ram  150000   28
5   Navin  120000   45
6  Akalya   30000   21

In [28]:
type(Info)

pandas.core.frame.DataFrame

In [29]:
Info.head()

     Name  Salary  Age
0     Raj  100000   22
1   Segar   80000   34
2   Nahul   90000   32
3  Kannan  200000   40
4     Ram  150000   28

In [30]:
Info.tail()

     Name  Salary  Age
2   Nahul   90000   32
3  Kannan  200000   40
4     Ram  150000   28
5   Navin  120000   45
6  Akalya   30000   21

In [31]:
Info.sample()

  Name  Salary  Age
4  Ram  150000   28

In [32]:
Info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Salary  7 non-null      int64
 2   Age     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [33]:
Info.describe()

              Salary        Age
count       7.000000   7.000000
mean   110000.000000  31.714286
std     54160.256031   8.882835
min     30000.000000  21.000000
25%     85000.000000  25.000000
50%    100000.000000  32.000000
75%    135000.000000  37.000000
max    200000.000000  45.000000

In [34]:
Info["Name"]

0       Raj
1     Segar
2     Nahul
3    Kannan
4       Ram
5     Navin
6    Akalya
Name: Name, dtype: object

In [35]:
Info.columns

Index(['Name', 'Salary', 'Age'], dtype='object')

In [36]:
Info[["Name","Salary"]]

     Name  Salary
0     Raj  100000
1   Segar   80000
2   Nahul   90000
3  Kannan  200000
4     Ram  150000
5   Navin  120000
6  Akalya   30000

In [37]:
Info.drop("Salary",axis=1) #Column#

     Name  Age
0     Raj   22
1   Segar   34
2   Nahul   32
3  Kannan   40
4     Ram   28
5   Navin   45
6  Akalya   21

In [38]:
Info.drop(3,axis=0) #row#

     Name  Salary  Age
0     Raj  100000   22
1   Segar   80000   34
2   Nahul   90000   32
4     Ram  150000   28
5   Navin  120000   45
6  Akalya   30000   21

In [39]:
Assending=Info.sort_values("Age",ascending = False)

In [40]:
Assending

     Name  Salary  Age
5   Navin  120000   45
3  Kannan  200000   40
1   Segar   80000   34
2   Nahul   90000   32
4     Ram  150000   28
0     Raj  100000   22
6  Akalya   30000   21

In [41]:
data = {"Name": ["muppudathi","Reni","kabi","hari"],
        "Age":[25,35,None,37]}

In [42]:
data

{'Name': ['muppudathi', 'Reni', 'kabi', 'hari'], 'Age': [25, 35, None, 37]}

In [43]:
Info2=pd.DataFrame(data)

In [44]:
Info2

         Name   Age
0  muppudathi  25.0
1        Reni  35.0
2        kabi   NaN
3        hari  37.0

In [45]:
Age_missing = Info2["Age"].mean()

In [46]:
Info2["Age"]=Info2["Age"].fillna(Age_missing)

In [47]:
Info2

         Name        Age
0  muppudathi  25.000000
1        Reni  35.000000
2        kabi  32.333333
3        hari  37.000000

In [49]:
Info2["Age"] = Info2["Age"].fillna(Info2["Age"].mean())

In [50]:
Info2

         Name        Age
0  muppudathi  25.000000
1        Reni  35.000000
2        kabi  32.333333
3        hari  37.000000

In [51]:
Info2.to_csv("workerdataset")

In [52]:
a=pd.read_csv("workerdataset")

In [53]:
a

   Unnamed: 0        Name        Age
0           0  muppudathi  25.000000
1           1        Reni  35.000000
2           2        kabi  32.333333
3           3        hari  37.000000

In [55]:
Info2.to_csv("workerdataset",index=False)

In [56]:
a1=pd.read_csv("workerdataset")

a1

Adding a New Column

In [58]:
Info2["Age_after_5_yrs"] = Info2["Age"]+5

In [59]:
Info2

         Name        Age  Age_after_5_yrs
0  muppudathi  25.000000        30.000000
1        Reni  35.000000        40.000000
2        kabi  32.333333        37.333333
3        hari  37.000000        42.000000

Filtering

In [65]:
filterd = Info2[Info2["Age"]>31]

In [66]:
filterd

   Name        Age  Age_after_5_yrs
1  Reni  35.000000        40.000000
2  kabi  32.333333        37.333333
3  hari  37.000000        42.000000

Part_2

In [75]:
b = pd.Series([1,2,3,4])

In [76]:
print(b)

0    1
1    2
2    3
3    4
dtype: int64

In [78]:
print("Dimension - ",b.ndim)
print("Datatype - ",b.dtype)
print("Shape -" ,b.shape)
print("Values -" ,b.values)
print("Index -" ,b.index)
print("Size -" ,b.size)
print("is Empty-",b.empty)
print("Converting to lsit -" ,b.tolist())

Dimension -  1
Datatype -  int64
Shape - (4,)
Values - [1 2 3 4]
Index - RangeIndex(start=0, stop=4, step=1)
Size - 4
is Empty- False
Converting to lsit - [1, 2, 3, 4]

In [80]:
b= pd.Series([1,22,32,3,3,3,4,15])
print("Unique Elements" ,b.unique()) # it prints which are not duplicated
print("Total Unique Elements ",b.nunique())
print("Value Counts",b.value_counts())

Unique Elements [ 1 22 32  3  4 15]
Total Unique Elements  6
Value Counts 3     3
1     1
22    1
32    1
4     1
15    1
Name: count, dtype: int64

In [81]:
dataset = pd.read_csv("Iris_dataset.csv")

In [82]:
dataset.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [83]:
dataset.nunique()

Id               150
SepalLengthCm     35
SepalWidthCm      23
PetalLengthCm     43
PetalWidthCm      22
Species            3
dtype: int64

In [84]:
dataset["Species"].nunique()

3

In [85]:
dataset["Species"].value_counts()

Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

Great!